SELECT * FROM ams.employee;

INSERT INTO `ams`.`employee`
(`employee_id`,
`employee_birth_date`,
`employee_department`,
`employee_email`,
`employee_gender`,
`employee_joining_date`,
`employee_name`)
VALUES
	(1, '1997-03-02', '総務部', 'emp0001@email.com', '男', '2024-04-01', '中島治紀'),
    (2, '1990-05-15', '営業部', 'emp0002@email.com', '女', '2023-10-15', '山田太郎'),
    (3,'1985-11-20', '研究開発部', 'emp0003@email.com', '男', '2023-09-01', '佐藤花子'),
    (4, '1988-04-12', '人事部', 'emp0004@email.com', '女', '2023-08-01', '鈴木一郎'),
    (5, '1992-09-25', '営業部', 'emp0005@email.com', '男', '2023-07-01', '田中恵美'),
    (6, '1987-02-18', '研究開発部', 'emp0006@email.com', '女', '2023-06-01', '伊藤健太'),
    (7, '1995-12-08', '人事部', 'emp0007@email.com', '男', '2023-05-01', '木村真理子'),
    (8, '1993-07-29', '営業部', 'emp0008@email.com', '女', '2023-04-01', '山口和也'),
    (9, '1989-10-03', '研究開発部', 'emp0009@email.com', '男', '2023-03-01', '渡辺美佐子'),
    (10, '1991-01-14', '総務部', 'emp0010@email.com', '女', '2023-02-01', '高橋直人'),
    (11, '1986-06-22', '人事部', 'emp0011@email.com', '男', '2023-01-01', '斎藤理沙');
    
DELETE FROM ams.user_role;
DELETE FROM ams.role;
DELETE FROM ams.user;
DELETE FROM ams.employee;

DROP TABLE ams.user_role;
DROP TABLE ams.role;
DROP TABLE ams.user;
DROP TABLE ams.employee;

INSERT INTO `ams`.`employee`
(`employee_id`, `employee_birth_date`, `employee_department`, `employee_email`, `employee_gender`, `employee_joining_date`, `employee_name`, `employee_age`)
VALUES
    (1, '1997-03-02', '総務部', 'emp0001@email.com', '男', '2024-04-01', '中島治紀', 27),
    (2, '1990-05-15', '営業部', 'emp0002@email.com', '女', '2023-10-15', '山田太郎', 34),
    (3, '1985-11-20', '研究開発部', 'emp0003@email.com', '男', '2023-09-01', '佐藤花子', 38),
    (4, '1988-04-12', '人事部', 'emp0004@email.com', '女', '2023-08-01', '鈴木一郎', 36),
    (5, '1992-09-25', '営業部', 'emp0005@email.com', '男', '2023-07-01', '田中恵美', 31),
    (6, '1987-02-18', '研究開発部', 'emp0006@email.com', '女', '2023-06-01', '伊藤健太', 37),
    (7, '1995-12-08', '人事部', 'emp0007@email.com', '男', '2023-05-01', '木村真理子', 28),
    (8, '1993-07-29', '営業部', 'emp0008@email.com', '女', '2023-04-01', '山口和也', 30),
    (9, '1989-10-03', '研究開発部', 'emp0009@email.com', '男', '2023-03-01', '渡辺美佐子', 34),
    (10, '1991-01-14', '総務部', 'emp0010@email.com', '女', '2023-02-01', '高橋直人', 33),
    (11, '1986-06-22', '人事部', 'emp0011@email.com', '男', '2023-01-01', '斎藤理沙', 38),
    (12, '1982-04-05', '営業部', 'emp0012@email.com', '女', '2022-12-01', '川口幸子', 42),
    (13, '1994-08-30', '研究開発部', 'emp0013@email.com', '男', '2022-11-01', '藤田圭介', 29),
    (14, '1991-02-15', '総務部', 'emp0014@email.com', '女', '2022-10-01', '宮本浩一', 33),
    (15, '1989-07-10', '人事部', 'emp0015@email.com', '男', '2022-09-01', '森田由紀', 34),
    (16, '1983-09-18', '営業部', 'emp0016@email.com', '女', '2022-08-01', '吉田真紀', 40),
    (17, '1992-12-25', '研究開発部', 'emp0017@email.com', '男', '2022-07-01', '田村智子', 31),
    (18, '1990-03-10', '人事部', 'emp0018@email.com', '女', '2022-06-01', '木下優子', 34),
    (19, '1988-11-14', '営業部', 'emp0019@email.com', '男', '2022-05-01', '小林修', 35),
    (20, '1994-01-20', '総務部', 'emp0020@email.com', '女', '2022-04-01', '田辺悠人', 30),
    (21, '1985-12-05', '研究開発部', 'emp0021@email.com', '男', '2022-03-01', '西村和子', 38),
    (22, '1991-06-18', '人事部', 'emp0022@email.com', '女', '2022-02-01', '佐々木恵子', 33),
    (23, '1993-08-12', '営業部', 'emp0023@email.com', '男', '2022-01-01', '井上克也', 30),
    (24, '1987-05-20', '研究開発部', 'emp0024@email.com', '女', '2021-12-01', '浜田尚美', 37),
    (25, '1989-02-14', '人事部', 'emp0025@email.com', '男', '2021-11-01', '安藤貴子', 35),
    (26, '1992-07-23', '営業部', 'emp0026@email.com', '女', '2021-10-01', '清水健一', 31),
    (27, '1988-04-18', '研究開発部', 'emp0027@email.com', '男', '2021-09-01', '長谷川光', 36),
    (28, '1990-11-12', '人事部', 'emp0028@email.com', '女', '2021-08-01', '山崎里美', 33),
    (29, '1993-06-22', '営業部', 'emp0029@email.com', '男', '2021-07-01', '木村良子', 31),
    (30, '1985-03-01', '研究開発部', 'emp0030@email.com', '女', '2021-06-01', '佐藤圭介', 39),
    (31, '1991-10-25', '人事部', 'emp0031@email.com', '男', '2021-05-01', '石井美奈', 32),
    (32, '1989-07-13', '営業部', 'emp0032@email.com', '女', '2021-04-01', '松本洋', 35),
    (33, '1987-01-22', '研究開発部', 'emp0033@email.com', '男', '2021-03-01', '野口太郎', 37),
    (34, '1994-05-05', '人事部', 'emp0034@email.com', '女', '2021-02-01', '原田和子', 30),
    (35, '1986-12-15', '営業部', 'emp0035@email.com', '男', '2021-01-01', '岩崎明', 37),
    (36, '1992-08-25', '研究開発部', 'emp0036@email.com', '女', '2020-12-01', '高田真理', 31),
    (37, '1984-04-08', '人事部', 'emp0037@email.com', '男', '2020-11-01', '中村由美', 40),
    (38, '1991-03-15', '営業部', 'emp0038@email.com', '女', '2020-10-01', '長田幸子', 33),
    (39, '1987-10-10', '研究開発部', 'emp0039@email.com', '男', '2020-09-01', '黒田康夫', 36),
    (40, '1989-06-22', '人事部', 'emp0040@email.com', '女', '2020-08-01', '宮田明', 35);
